curl_expo_api/app/controllers/favorites_controller.rb

    def create
        favorite = Favorite.create(user_id: params[:user_id], product_id: params[:product_id], category: params[:category])
---
INSERT INTO "favorites" ("category", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category", "Favorite"], ["product_id", 14], ["user_id", 14], ["created_at", "2020-04-15 22:05:04.323514"], ["updated_at", "2020-04-15 22:05:04.323514"]]

    def destroy
        Favorite.destroy(params[:id])
---
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 37]]