curl_expo_api/app/controllers/ingredients_controller.rb

    def index
        ingredients = Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"

    def create
        ingredient = Ingredient.find_or_create_by(name: params[:name])
        join = ProductIngredient.create(ingredient_id: ingredient.id, product_id: params[:product_id])
---
INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Water"], ["created_at", "2020-04-15 18:25:23.200042"], ["updated_at", "2020-04-15 18:25:23.200042"]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."name" = ? LIMIT ?  [["name", "Water"], ["LIMIT", 1]]
INSERT INTO "product_ingredients" ("product_id", "ingredient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["ingredient_id", 7], ["created_at", "2020-04-15 18:55:43.736935"], ["updated_at", "2020-04-15 18:55:43.736935"]]