curl_expo_api/app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-04-14 20:43:30.866832"], ["updated_at", "2020-04-14 20:43:30.866832"]]
UPDATE "products" SET "name" = ?, "brand" = ?, "image" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Cur"], ["brand", ""], ["image", ""], ["updated_at", "2020-04-14 20:43:30.876740"], ["id", 15]]
---
    def create
        product = Product.create
        product.name = params[:name]
        product.brand = params[:brand]
        product.image = params[:image]
        product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Pure Regrowth Serum With Lavender Fragrance"], ["updated_at", "2020-04-17 17:37:31.614911"], ["id", 6]]
---
    def update
        product = Product.find(params[:id])
        if product
            product.update(name: params[:name], brand: params[:brand], image: params[:image])