curl_expo_api/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("content", "score", "user_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "Nice, but a little too heavy for my hair"], ["score", 6], ["user_id", 8], ["product_id", 4], ["created_at", "2020-04-13 14:57:37.781873"], ["updated_at", "2020-04-13 14:57:37.781873"]]
---
    def create
        review = Review.create
        review.content = params[:content]
        review.score = params[:score]
        review.user_id = params[:user_id]
        review.product_id = params[:product_id]
        review.save