curl_expo_api/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-04-16 15:04:12.263337"], ["updated_at", "2020-04-16 15:04:12.263337"]]
UPDATE "users" SET "username" = ?, "email" = ?, "password" = ?, "hair_type" = ?, "hair_width" = ?, "hair_porosity" = ?, "hair_density" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
    def create
        #add "this user already exists" validation
        user = User.create
        user.username = params[:username]
        user.email = params[:email]
        user.password = params[:password]
        user.hair_type = params[:hair_type]
        user.hair_width = params[:hair_width]
        user.hair_porosity = params[:hair_porosity]
        user.hair_density = params[:hair_density]
        user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bowchamp@girl.com"], ["LIMIT", 1]]
---
    def login
        user = User.find_by email: params[:email]

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "love@princess.com"], ["updated_at", "2020-04-16 14:59:59.662191"], ["id", 12]]
---
    def update
        user = User.find(params[:id])
        if user
            user.update(username: params[:username], email: params[:email], password: params[:password], hair_type: params[:hair_type], hair_width: params[:hair_width], hair_porosity: params[:hair_porosity], hair_density: params[:hair_density])